/*Задание: напишите функцию countBs, которая принимает строку в качестве единственного аргумента
и возвращает число, показывающее, сколько больших букв "B" содержится в этой строке.
Затем напишите функцию countChar, которая ведет себя как countBs, за ислючением того, что принимает
второй аргумент, указывающий, какие именно символы нужно посчитать.
Перепишите countBs, чтобы использовать эту новую функцию. */

//Первая версия функции countBs, определяющая количество букв B в строке
/*function countBs(str)
{
	let n = 0;  //Инициализация переменной, хранящей количество вхождений буквы B в строку str
	
	//Цикл по каждому символу строки str
	for(let each of str)
	{
		//Если текущий символ - это символ B, то увеличиваем счетчик n
		if(each == "B") 
			n++;
	}
	//Возвращаем результат
	return n;
}*/
//Функция, определяющая количество вхождений символа ch в строку str
function countChar(str, ch = 'B') //если в вызове функции не указан символ ch, по умолчанию - B
{
	let n = 0;      //Инициализация счетчика
	//Цикл по каждому символу строки str
	for(let each of str)
	{
		//Если текущий символ - это символ ch, то увеличиваем счетчик n
		if(each == ch)
			n++;
	}
	//Возвращаем результат
	return n;
}
//Вторая версия функции countBs с вызовом countChar
function countBs(str)
{
	return countChar(str);
}
//Вывод примера
console.log(`countBs("BBC") = ${countBs("BBC")}`);
// → 2
console.log(`countChar("kakkerlak", "k") = ${countChar("kakkerlak", "k")}`);
// → 4

//Используем инструмент Node.js для осуществления чтения из консоли
const readline = require('readline').createInterface({
	input: process.stdin,
	output: process.stdout
  })
  //Запрашиваем у пользователя ввод данных
    readline.question(`Enter string and symbol (Example: abcccd, c): `, (x) => {
	//преобразуем введенные данные из строки в два элемента массива: строка и символ
	let arr = x.split(/[\s,;]+/,2);
	//Вызываем функцию countChar с введенными данными и выводим результат в консоль
	console.log(`countChar(${arr[0]},${arr[1]}) = ${countChar(arr[0],arr[1])}`);
	readline.close()
  });
